Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/radio/SI4468/si4468_driver.cpp

#include <tinyhal.h>
#include <Samraksh\Message.h>
#include <Samraksh\Radio.h>
#include <string.h>

#include "si446x.h"

// Hardware stuff
#include <stm32f10x.h>

// If MAC layer calls an operation before previous finished, refuse the new request
// Alternatively, can attempt to service ourself.
#define SI4468_FORCE_MAC_SERVICE

enum { SI_DUMMY=0, };

// For now, memorize all WWF serial numbers
// Yes these are strings and yes I'm a terrible person.
// These are hex CPU serial numbers
enum { serial_max = 2, serial_per = 25 };
//const char wwf_serial_numbers[serial_max][serial_per] = { "3300d9054642353044501643", "3300e0054642353045241643" };
const char dotnow_serial_numbers[serial_max][serial_per] = { "392dd9054355353848400843", "3400d805414d303635341043" };
// end serial number list.

// SETS SI446X PRINTF DEBUG VERBOSITY
const unsigned si4468x_debug_level = DEBUG02; // CHANGE ME.

// Pin list used in setup.
static SI446X_pin_setup_t SI446X_pin_setup;

// CORE LOCKING STUFF, MOVE ME LATER
static volatile uint32_t spi_lock;
static volatile uint32_t radio_lock;

// CMSIS includes these functions in some form
// But they didn't quite work for me and I didn't want to mod library so... --NPS
static uint32_t ___LOAD(volatile uint32_t *addr) __attribute__ ((naked));
static uint32_t ___STORE(uint32_t value, volatile uint32_t *addr) __attribute__ ((naked));

static uint32_t ___LOAD(volatile uint32_t *addr)
{
  __ASM("ldrex r0, [r0]");
  __ASM("bx lr");
}

static uint32_t ___STORE(uint32_t value, volatile uint32_t *addr)
{
  __ASM("strex r0, r0, [r1]");
  __ASM("bx lr");
}

// Returns 0 if failed to aquire lock.
static int get_lock_inner(volatile uint32_t *Lock_Variable) {
	int status;
	if (___LOAD(Lock_Variable) != 0) {
		__ASM("clrex");
		return 0;
	}
	status = ___STORE(radio_lock_all, Lock_Variable);
	__DMB();

	return (status == 0);
}

// Should try more than once, can legit fail even if lock is free.
// Example, will never succeed if any interrupt hits in between.
// ldrex-strex only guarantees that lock is free when it says so, but NOT the inverse.
static int get_lock(volatile uint32_t *Lock_Variable) {
	int attempts=si446x_lock_max_attempts;
	do {
		if ( get_lock_inner(Lock_Variable) )
			return 1;
	} while (--attempts);
	return 0;
}

static void free_lock(volatile uint32_t *Lock_Variable) {
	__DMB();
	*Lock_Variable = 0;
	return;
}

static int si446x_spi_lock() {
	return get_lock(&spi_lock);
}

static int si446x_spi_unlock() {
	free_lock(&spi_lock);
}

static int si446x_radio_lock(void) {
	return get_lock(&radio_lock);
}

static int si446x_radio_unlock(void) {
	free_lock(&radio_lock);
}
// END LOCKING STUFF

static void si446x_debug_print(int priority, const char *fmt, ...) {
    va_list args;
    va_start(args, fmt);

    if(priority >= si4468x_debug_level) {
		hal_vprintf(fmt, args);
	}

    va_end(args);
}

static void si446x_spi2_handle_interrupt(GPIO_PIN Pin, BOOL PinState, void* Param);

static si446x_tx_callback_t tx_callback;
static si446x_rx_callback_t rx_callback;

static HAL_CONTINUATION tx_callback_continuation;
static HAL_CONTINUATION rx_callback_continuation;
static HAL_CONTINUATION int_defer_continuation;

static unsigned isInit = 0;
static int si446x_channel = 0;
static unsigned tx_power = 0;
static volatile UINT64 rx_timestamp;

// Radio PAL stuff
static Radio<Message_15_4_t> radio_si446x_spi2;
static UINT16 active_mac_index; // For some reason this is tied to HAL ... suspect should be in PAL object
static Message_15_4_t tx_msg; // SI_DUMMY message to handle stupid PAL. FIX ME.
static Message_15_4_t* tx_msg_ptr;
static Message_15_4_t rx_msg;
static Message_15_4_t* rx_msg_ptr;
// END RADIO PALL STUFF

// In case we had to defer interrupt handling for any reason...
static void int_cont_do(void *arg) {
	si446x_debug_print(DEBUG01,"SI446X: int_cont_do()\r\n");
	si446x_spi2_handle_interrupt( SI446X_pin_setup.nirq_mf_pin, false, NULL );
}

// I agree its questionable that I'm being too complicated with continuation stuff... --NPS.
// TX CALLBACK
static void tx_cont_do(void *arg) {
	if (tx_callback != NULL)
		tx_callback();

	si446x_debug_print(DEBUG02,"SI446X: tx_cont_do()\r\n");

	SendAckFuncPtrType AckHandler = radio_si446x_spi2.GetMacHandler(active_mac_index)->GetSendAckHandler();
	(*AckHandler)(tx_msg_ptr, si446x_packet_size, NetworkOperations_Success, SI_DUMMY);

	si446x_radio_unlock();
}

static void rx_cont_do(void *arg) {
	uint8_t rx_pkt[si446x_packet_size];
	int size;

	si446x_debug_print(DEBUG01,"SI446X: rx_cont_do()\r\n");

	// TODO: NEED TO LOCK SPI BUS HERE, BUT CAREFULLY. (a day later I forgot why...)

	if ( !si446x_spi_lock() ) {
		si446x_debug_print(ERR99,"SI446X: rx_cont_do() Somehow radio SPI was busy when servicing RX... tell Nathan. Trying agail.\r\n");
		rx_callback_continuation.Enqueue();
		return;
	}

	size = si446x_get_packet_info(0,0,0);
	si446x_read_rx_fifo(size, rx_pkt);

	if (rx_callback != NULL)
		rx_callback(rx_timestamp, size, rx_pkt);

	si446x_get_modem_status( 0xFF ); // Refresh RSSI

	si446x_radio_unlock();
	si446x_spi_unlock();

	if (rx_msg_ptr == NULL) return; // Nothing left to do.

	// Metadata struct
	IEEE802_15_4_Metadata_t* metadata = rx_msg_ptr->GetMetaData();

	// Copy packet to MAC packet
	memcpy( (uint8_t *)rx_msg_ptr, rx_pkt, size );

	// Set Metadata
	metadata->SetRssi( si446x_get_latched_rssi() );
	metadata->SetLqi(0);  // No meaning on this radio
	metadata->SetReceiveTimeStamp((INT64)rx_timestamp);

	// I guess this swaps rx_msg_ptr as well???
	//(rx_msg_ptr->GetHeader())->SetLength(size);
	(rx_msg_ptr->GetHeader())->length = size; // the "new" way. blarg.

	rx_msg_ptr = (Message_15_4_t *) (radio_si446x_spi2.GetMacHandler(active_mac_index)->GetReceiveHandler())(rx_msg_ptr, size);
}

void si446x_hal_register_tx_callback(si446x_tx_callback_t callback) {
	tx_callback = callback;
}

void si446x_hal_unregister_tx_callback() {
	tx_callback = NULL;
}

void si446x_hal_register_rx_callback(si446x_rx_callback_t callback) {
	rx_callback = callback;
}

